{

    "InnerEyeLore": {
        "context": "story", "style": "default",
        "statements": [
            "The truth reveals itself...",
            "Our Sun has an unparalleled gift to commune with spirits.",
            "Though it brought him nothing but grief, he used his power for good.",
            "Eventually he grew to understand his gift, and in doing so, gained profound power."
        ]
    },


    "InnerEyeIntro": {
        "context": "story", "style": "default",
        "statements": [
            "Oh, do you seek enlightenment, too?",
            "I fear you may be wasting your time.  Only those who are truly rational can proceed.",
            "...What am I doing out here, you ask?  Well...",
            "...That's none of your business!"
        ]
    },
    
    "InnerEyeThemeSuperior": {
        "context": "story", "style": "default",
        "statements": [
            "I'm tired of listening to all of their stupid problems"
        ]
    },
    "InnerEyeThemeSuperior2": {
        "context": "story", "style": "default",
        "statements": [
            "if people would just listen to me, they would be better off"
        ]
    },
    "InnerEyeThemeSuperior3": {
        "context": "story", "style": "default",
        "statements": [
            "why should I lie just so that other people are more comfortable"
        ]
    },
    "InnerEyeThemeSuperior4": {
        "context": "story", "style": "default",
        "statements": [
            "I've found a way for these idiots to finally become useful"
        ]
    },
    
    
    "InnerEyeThemeEnlightenment": {
        "context": "story", "style": "default",
        "statements": [
            "I know that I know nothing",
            "that's why I'm the smartest one here"
        ]
    },
    "InnerEyeThemeEnlightenment2": {
        "context": "story", "style": "default",
        "statements": [
            "he who knows, does not speak",
            "er, I mean.....",
            "........",
            ".................."
        ]
    },
    "InnerEyeThemeEnlightenment3": {
        "context": "story", "style": "default",
        "statements": [
            "the way to enlightenment is nothing but self-cultivation",
            "...in your case, that means learning when to keep quiet and listen"
        ]
    },
    "InnerEyeThemeEnlightenment4": {
        "context": "story", "style": "default",
        "statements": [
            "in this moment, I am exultant...not because of any fake idol's favor...",
            "...but because I am refined by my intellect"
        ]
    },
    
    
    "InnerEyeThemeGuide": {
        "context": "story", "style": "default",
        "statements": [
            "Can you feel it?",
            "Can you feel His exhaustion?",
            "He feels a responsibility to use his gifts to help others.",
            "It is overwhelming, but he perseveres for all of our sakes."
        ]
    },
    "InnerEyeThemeTired": {
        "context": "story", "style": "default",
        "statements": [
            "the same stories, the same issues, the same questions, over and over and over"
        ]
    },
    "InnerEyeThemeTired2": {
        "context": "story", "style": "default",
        "statements": [
            "their thoughts are so loud",
            "sometimes I can't hear myself think"
        ]
    },
    "InnerEyeThemeTired3": {
        "context": "story", "style": "default",
        "statements": [
            "what has any of this power done for me"
        ]
    },
    "InnerEyeThemePower": {
        "context": "story", "style": "default",
        "statements": [
            "of course the same rules that apply to them apply to me too"
        ]
    },
    "InnerEyeThemePower2": {
        "context": "story", "style": "default",
        "statements": [
            "first start with influence, and then speak through them"
        ]
    },
    "InnerEyeThemePower3": {
        "context": "story", "style": "default",
        "statements": [
            "they seem to be attracted to symbols that reflect their inner nature"
        ]
    },
    "InnerEyeThemePower4": {
        "context": "story", "style": "default",
        "statements": [
            "the weakest ones just mindlessly parrot what they can hear"
        ]
    },
    
    "InnerEyeHideoutGuard": {
        "context": "story", "style": "default",
        "statements": [
            "Ah, an outsider.",
            "You have no associations, I hope.",
            "We have gathered here to avoid the politics of the outside."
        ]
    },
    "InnerEyeHideoutPillar": {
        "context": "story", "style": "default",
        "statements": [
            "What is the Pillar?  I only know what I have heard...",
            "Some believe it is a group that has banded together under a leader...",
            "This leader is said to have access to the Sun's power.",
            "However, such a thing cannot be possible."
        ]
    },
    "InnerEyeHideoutSun": {
        "context": "story", "style": "default",
        "statements": [
            "Many of those on the outside believe in something they call the Sun.",
            "They seem to believe it created this place, and watches over it.",
            "It is superstitious foolishness...there is no evidence of such a thing.",
            "I only put trust in what my eyes can see.",
            "...Of course, I don't have eyes anymore, but that's not the point!"
        ]
    },
    "InnerEyeHideoutRift": {
        "context": "story", "style": "default",
        "statements": [
            "To the north, there is a large gathering of spirits that have found refuge.",
            "However, they are a bit too irrational for my liking.  A very simple-minded sort.",
            "Also, the path to get there is very treacherous...",
            "Word has spread of something called the Reaper.  I don't like the sound of that."
        ]
    },

    
    "InnerEyeHideoutSpecial": {
        "context": "story", "style": "default",
        "statements": [
            "From here, I can sense different sources of power scattered across the world...",
            "Spirits that have inherited the power of the area that they reside in.",
            "How is this possible?  Perhaps they share some rapport with their environment.",
            "This world seems to have a life of its own.  Maybe even a mind..."
        ]
    },
    "InnerEyeHideoutProphet": {
        "context": "story", "style": "default",
        "statements": [
            "There exists a powerful spirit that is known as the Prophet",
            "On a mountain-top, it shares its insight to all those who can reach it",
            "But it seems that few end up understanding what it is able to share"
        ]
    },
    "InnerEyeHideoutMirror": {
        "context": "story", "style": "default",
        "statements": [
            "There exists a powerful spirit that is known only as the Mirror",
            "It takes on a form matching the inner nature of any who approach it",
            "But the truth it reveals is always unflattering"
        ]
    },
    "InnerEyeHideoutReaper": {
        "context": "story", "style": "default",
        "statements": [
            "There exists a powerful spirit that is known as the Reaper",
            "It has a black and cursed desire, from which no good will come",
            "And yet those who seek annihilation are pulled towards its red gaze"
        ]
    },
    "InnerEyeHideoutRedOne": {
        "context": "story", "style": "default",
        "statements": [
            "There exists a powerful spirit that is known only as the Red One",
            "It leads those who have fallen for a lie of salvation and purpose",
            "I wonder what it hopes to accomplish with this power",
            "In a place where all is a flat circle"
        ]
    },
    "InnerEyeHideoutWarden": {
        "context": "story", "style": "default",
        "statements": [
            "There exists a powerful spirit that is known only as the Warden",
            "It has assumed the task of protecting its sanctuary, the last drops of hope",
            "I wonder how such a place can even exist",
            "When everything else has succumbed to the Sun"
        ]
    }


}